it/src/Documents/ПеремещениеОС/ПеремещениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеОС</name>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизацииСтарое</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПомещениеСтарое</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛОтправительСтарое</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСВладелец</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/InformationRegisters/ОтключенныеКомпьютеры/ОтключенныеКомпьютеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтключенныеКомпьютеры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/Documents/ПеремещениеОС/ManagerModule.bsl
// Получить таблицу .
//
Функция ПолучитьТаблицуМестонахождениеОС(ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеОССведенияОС.Ссылка КАК Регистратор,
	               |	ПеремещениеОССведенияОС.Ссылка.Дата КАК Период,
	               |	ПеремещениеОССведенияОС.ОсновноеСредство,
	               |	ПеремещениеОССведенияОС.Ссылка.Организация КАК Организация,
	               |	ПеремещениеОССведенияОС.ПодразделениеОрганизации,
	               |	ПеремещениеОССведенияОС.МОЛ КАК МОЛ,
	               |	ПеремещениеОССведенияОС.Помещение КАК Помещение,
	               |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОСВладелец,
	               |	ПеремещениеОССведенияОС.ИмяДомена
	               |ИЗ
	               |	Документ.ПеремещениеОС.СведенияОС КАК ПеремещениеОССведенияОС
	               |ГДЕ
	               |	ПеремещениеОССведенияОС.Ссылка = &Ссылка";
	
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Возврат(Запрос.Выполнить().Выгрузить());
	 
КонецФункции // ПолучитьТаблицуКомплектующих()


 // <Описание функции>
 //
 // Параметры
 //  <Параметр1>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //  <Параметр2>  - <Тип.Вид> - <описание параметра>
 //                 <продолжение описания параметра>
 //
 // Возвращаемое значение:
 //   <Тип.Вид>   - <описание возвращаемого значения>
 //
 Функция ПолучитьТаблицуОтключенныеКомпьютеры(ДополнительныеСвойства) Экспорт
 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ПеремещениеОССведенияОС.Ссылка КАК Регистратор,
	                |	ПеремещениеОССведенияОС.Ссылка.Дата КАК Период,
	                |	ПеремещениеОССведенияОС.ОсновноеСредство КАК ИдентификаторКомпьютера,
	                |	ЛОЖЬ КАК Отключен
	                |ИЗ
	                |	Документ.ПеремещениеОС.СведенияОС КАК ПеремещениеОССведенияОС
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтключенныеКомпьютеры.СрезПоследних(&МоментВремени, ) КАК ОтключенныеКомпьютерыСрезПоследних
	                |		ПО ПеремещениеОССведенияОС.ОсновноеСредство = ОтключенныеКомпьютерыСрезПоследних.ИдентификаторКомпьютера
	                |ГДЕ
	                |	ПеремещениеОССведенияОС.Ссылка = &Ссылка
	                |	И ОтключенныеКомпьютерыСрезПоследних.Отключен";
	 
	 Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	 Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДополнительныеСвойства.ДляПроведения.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	 
	 Возврат(Запрос.Выполнить().Выгрузить());
 
 КонецФункции // ПолучитьТаблицуОтключенныеКомпьютеры()
